Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
object_input_1 (InputLayer)     [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
object_conv1_pad (ZeroPadding2D (None, 225, 225, 3)  0           object_input_1[0][0]             
__________________________________________________________________________________________________
object_conv1 (Conv2D)           (None, 112, 112, 32) 864         object_conv1_pad[0][0]           
__________________________________________________________________________________________________
object_conv1_bn (BatchNormaliza (None, 112, 112, 32) 128         object_conv1[0][0]               
__________________________________________________________________________________________________
object_conv1_relu (ReLU)        (None, 112, 112, 32) 0           object_conv1_bn[0][0]            
__________________________________________________________________________________________________
object_conv_dw_1 (DepthwiseConv (None, 112, 112, 32) 288         object_conv1_relu[0][0]          
__________________________________________________________________________________________________
object_conv_dw_1_bn (BatchNorma (None, 112, 112, 32) 128         object_conv_dw_1[0][0]           
__________________________________________________________________________________________________
object_conv_dw_1_relu (ReLU)    (None, 112, 112, 32) 0           object_conv_dw_1_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_1 (Conv2D)       (None, 112, 112, 64) 2048        object_conv_dw_1_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_1_bn (BatchNorma (None, 112, 112, 64) 256         object_conv_pw_1[0][0]           
__________________________________________________________________________________________________
object_conv_pw_1_relu (ReLU)    (None, 112, 112, 64) 0           object_conv_pw_1_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pad_2 (ZeroPadding2 (None, 113, 113, 64) 0           object_conv_pw_1_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_2 (DepthwiseConv (None, 56, 56, 64)   576         object_conv_pad_2[0][0]          
__________________________________________________________________________________________________
object_conv_dw_2_bn (BatchNorma (None, 56, 56, 64)   256         object_conv_dw_2[0][0]           
__________________________________________________________________________________________________
object_conv_dw_2_relu (ReLU)    (None, 56, 56, 64)   0           object_conv_dw_2_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_2 (Conv2D)       (None, 56, 56, 128)  8192        object_conv_dw_2_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_2_bn (BatchNorma (None, 56, 56, 128)  512         object_conv_pw_2[0][0]           
__________________________________________________________________________________________________
object_conv_pw_2_relu (ReLU)    (None, 56, 56, 128)  0           object_conv_pw_2_bn[0][0]        
__________________________________________________________________________________________________
object_conv_dw_3 (DepthwiseConv (None, 56, 56, 128)  1152        object_conv_pw_2_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_3_bn (BatchNorma (None, 56, 56, 128)  512         object_conv_dw_3[0][0]           
__________________________________________________________________________________________________
object_conv_dw_3_relu (ReLU)    (None, 56, 56, 128)  0           object_conv_dw_3_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_3 (Conv2D)       (None, 56, 56, 128)  16384       object_conv_dw_3_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_3_bn (BatchNorma (None, 56, 56, 128)  512         object_conv_pw_3[0][0]           
__________________________________________________________________________________________________
object_conv_pw_3_relu (ReLU)    (None, 56, 56, 128)  0           object_conv_pw_3_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pad_4 (ZeroPadding2 (None, 57, 57, 128)  0           object_conv_pw_3_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_4 (DepthwiseConv (None, 28, 28, 128)  1152        object_conv_pad_4[0][0]          
__________________________________________________________________________________________________
object_conv_dw_4_bn (BatchNorma (None, 28, 28, 128)  512         object_conv_dw_4[0][0]           
__________________________________________________________________________________________________
object_conv_dw_4_relu (ReLU)    (None, 28, 28, 128)  0           object_conv_dw_4_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_4 (Conv2D)       (None, 28, 28, 256)  32768       object_conv_dw_4_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_4_bn (BatchNorma (None, 28, 28, 256)  1024        object_conv_pw_4[0][0]           
__________________________________________________________________________________________________
object_conv_pw_4_relu (ReLU)    (None, 28, 28, 256)  0           object_conv_pw_4_bn[0][0]        
__________________________________________________________________________________________________
object_conv_dw_5 (DepthwiseConv (None, 28, 28, 256)  2304        object_conv_pw_4_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_5_bn (BatchNorma (None, 28, 28, 256)  1024        object_conv_dw_5[0][0]           
__________________________________________________________________________________________________
object_conv_dw_5_relu (ReLU)    (None, 28, 28, 256)  0           object_conv_dw_5_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_5 (Conv2D)       (None, 28, 28, 256)  65536       object_conv_dw_5_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_5_bn (BatchNorma (None, 28, 28, 256)  1024        object_conv_pw_5[0][0]           
__________________________________________________________________________________________________
object_conv_pw_5_relu (ReLU)    (None, 28, 28, 256)  0           object_conv_pw_5_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pad_6 (ZeroPadding2 (None, 29, 29, 256)  0           object_conv_pw_5_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_6 (DepthwiseConv (None, 14, 14, 256)  2304        object_conv_pad_6[0][0]          
__________________________________________________________________________________________________
object_conv_dw_6_bn (BatchNorma (None, 14, 14, 256)  1024        object_conv_dw_6[0][0]           
__________________________________________________________________________________________________
object_conv_dw_6_relu (ReLU)    (None, 14, 14, 256)  0           object_conv_dw_6_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_6 (Conv2D)       (None, 14, 14, 512)  131072      object_conv_dw_6_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_6_bn (BatchNorma (None, 14, 14, 512)  2048        object_conv_pw_6[0][0]           
__________________________________________________________________________________________________
object_conv_pw_6_relu (ReLU)    (None, 14, 14, 512)  0           object_conv_pw_6_bn[0][0]        
__________________________________________________________________________________________________
object_conv_dw_7 (DepthwiseConv (None, 14, 14, 512)  4608        object_conv_pw_6_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_7_bn (BatchNorma (None, 14, 14, 512)  2048        object_conv_dw_7[0][0]           
__________________________________________________________________________________________________
object_conv_dw_7_relu (ReLU)    (None, 14, 14, 512)  0           object_conv_dw_7_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_7 (Conv2D)       (None, 14, 14, 512)  262144      object_conv_dw_7_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_7_bn (BatchNorma (None, 14, 14, 512)  2048        object_conv_pw_7[0][0]           
__________________________________________________________________________________________________
object_conv_pw_7_relu (ReLU)    (None, 14, 14, 512)  0           object_conv_pw_7_bn[0][0]        
__________________________________________________________________________________________________
object_conv_dw_8 (DepthwiseConv (None, 14, 14, 512)  4608        object_conv_pw_7_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_8_bn (BatchNorma (None, 14, 14, 512)  2048        object_conv_dw_8[0][0]           
__________________________________________________________________________________________________
object_conv_dw_8_relu (ReLU)    (None, 14, 14, 512)  0           object_conv_dw_8_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_8 (Conv2D)       (None, 14, 14, 512)  262144      object_conv_dw_8_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_8_bn (BatchNorma (None, 14, 14, 512)  2048        object_conv_pw_8[0][0]           
__________________________________________________________________________________________________
object_conv_pw_8_relu (ReLU)    (None, 14, 14, 512)  0           object_conv_pw_8_bn[0][0]        
__________________________________________________________________________________________________
object_conv_dw_9 (DepthwiseConv (None, 14, 14, 512)  4608        object_conv_pw_8_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_9_bn (BatchNorma (None, 14, 14, 512)  2048        object_conv_dw_9[0][0]           
__________________________________________________________________________________________________
object_conv_dw_9_relu (ReLU)    (None, 14, 14, 512)  0           object_conv_dw_9_bn[0][0]        
__________________________________________________________________________________________________
object_conv_pw_9 (Conv2D)       (None, 14, 14, 512)  262144      object_conv_dw_9_relu[0][0]      
__________________________________________________________________________________________________
object_conv_pw_9_bn (BatchNorma (None, 14, 14, 512)  2048        object_conv_pw_9[0][0]           
__________________________________________________________________________________________________
object_conv_pw_9_relu (ReLU)    (None, 14, 14, 512)  0           object_conv_pw_9_bn[0][0]        
__________________________________________________________________________________________________
object_conv_dw_10 (DepthwiseCon (None, 14, 14, 512)  4608        object_conv_pw_9_relu[0][0]      
__________________________________________________________________________________________________
object_conv_dw_10_bn (BatchNorm (None, 14, 14, 512)  2048        object_conv_dw_10[0][0]          
__________________________________________________________________________________________________
object_conv_dw_10_relu (ReLU)   (None, 14, 14, 512)  0           object_conv_dw_10_bn[0][0]       
__________________________________________________________________________________________________
object_conv_pw_10 (Conv2D)      (None, 14, 14, 512)  262144      object_conv_dw_10_relu[0][0]     
__________________________________________________________________________________________________
object_conv_pw_10_bn (BatchNorm (None, 14, 14, 512)  2048        object_conv_pw_10[0][0]          
__________________________________________________________________________________________________
object_conv_pw_10_relu (ReLU)   (None, 14, 14, 512)  0           object_conv_pw_10_bn[0][0]       
__________________________________________________________________________________________________
object_conv_dw_11 (DepthwiseCon (None, 14, 14, 512)  4608        object_conv_pw_10_relu[0][0]     
__________________________________________________________________________________________________
object_conv_dw_11_bn (BatchNorm (None, 14, 14, 512)  2048        object_conv_dw_11[0][0]          
__________________________________________________________________________________________________
object_conv_dw_11_relu (ReLU)   (None, 14, 14, 512)  0           object_conv_dw_11_bn[0][0]       
__________________________________________________________________________________________________
object_conv_pw_11 (Conv2D)      (None, 14, 14, 512)  262144      object_conv_dw_11_relu[0][0]     
__________________________________________________________________________________________________
object_conv_pw_11_bn (BatchNorm (None, 14, 14, 512)  2048        object_conv_pw_11[0][0]          
__________________________________________________________________________________________________
object_conv_pw_11_relu (ReLU)   (None, 14, 14, 512)  0           object_conv_pw_11_bn[0][0]       
__________________________________________________________________________________________________
object_conv_pad_12 (ZeroPadding (None, 15, 15, 512)  0           object_conv_pw_11_relu[0][0]     
__________________________________________________________________________________________________
object_conv_dw_12 (DepthwiseCon (None, 7, 7, 512)    4608        object_conv_pad_12[0][0]         
__________________________________________________________________________________________________
object_conv_dw_12_bn (BatchNorm (None, 7, 7, 512)    2048        object_conv_dw_12[0][0]          
__________________________________________________________________________________________________
object_conv_dw_12_relu (ReLU)   (None, 7, 7, 512)    0           object_conv_dw_12_bn[0][0]       
__________________________________________________________________________________________________
object_conv_pw_12 (Conv2D)      (None, 7, 7, 1024)   524288      object_conv_dw_12_relu[0][0]     
__________________________________________________________________________________________________
object_conv_pw_12_bn (BatchNorm (None, 7, 7, 1024)   4096        object_conv_pw_12[0][0]          
__________________________________________________________________________________________________
object_conv_pw_12_relu (ReLU)   (None, 7, 7, 1024)   0           object_conv_pw_12_bn[0][0]       
__________________________________________________________________________________________________
object_conv_dw_13 (DepthwiseCon (None, 7, 7, 1024)   9216        object_conv_pw_12_relu[0][0]     
__________________________________________________________________________________________________
object_conv_dw_13_bn (BatchNorm (None, 7, 7, 1024)   4096        object_conv_dw_13[0][0]          
__________________________________________________________________________________________________
object_conv_dw_13_relu (ReLU)   (None, 7, 7, 1024)   0           object_conv_dw_13_bn[0][0]       
__________________________________________________________________________________________________
object_conv_pw_13 (Conv2D)      (None, 7, 7, 1024)   1048576     object_conv_dw_13_relu[0][0]     
__________________________________________________________________________________________________
object_conv_pw_13_bn (BatchNorm (None, 7, 7, 1024)   4096        object_conv_pw_13[0][0]          
__________________________________________________________________________________________________
dense_input (InputLayer)        [(None, 512)]        0                                            
__________________________________________________________________________________________________
object_conv_pw_13_relu (ReLU)   (None, 7, 7, 1024)   0           object_conv_pw_13_bn[0][0]       
__________________________________________________________________________________________________
text_dense (Dense)              (None, 256)          131328      dense_input[0][0]                
__________________________________________________________________________________________________
object_conv2d (Conv2D)          (None, 112, 112, 64) 4160        object_conv_pw_1_relu[0][0]      
__________________________________________________________________________________________________
object_conv2d_1 (Conv2D)        (None, 56, 56, 64)   8256        object_conv_pw_3_relu[0][0]      
__________________________________________________________________________________________________
object_conv2d_2 (Conv2D)        (None, 28, 28, 64)   16448       object_conv_pw_5_relu[0][0]      
__________________________________________________________________________________________________
object_conv2d_3 (Conv2D)        (None, 14, 14, 64)   32832       object_conv_pw_11_relu[0][0]     
__________________________________________________________________________________________________
object_conv2d_4 (Conv2D)        (None, 7, 7, 64)     65600       object_conv_pw_13_relu[0][0]     
__________________________________________________________________________________________________
text_dropout (Dropout)          (None, 256)          0           text_dense[0][0]                 
__________________________________________________________________________________________________
object_gap1 (GlobalAveragePooli (None, 64)           0           object_conv2d[0][0]              
__________________________________________________________________________________________________
object_gap2 (GlobalAveragePooli (None, 64)           0           object_conv2d_1[0][0]            
__________________________________________________________________________________________________
object_gap3 (GlobalAveragePooli (None, 64)           0           object_conv2d_2[0][0]            
__________________________________________________________________________________________________
object_gap4 (GlobalAveragePooli (None, 64)           0           object_conv2d_3[0][0]            
__________________________________________________________________________________________________
object_gap5 (GlobalAveragePooli (None, 64)           0           object_conv2d_4[0][0]            
__________________________________________________________________________________________________
text_dense_1 (Dense)            (None, 128)          32896       text_dropout[0][0]               
__________________________________________________________________________________________________
object_average (Average)        (None, 64)           0           object_gap1[0][0]                
                                                                 object_gap2[0][0]                
                                                                 object_gap3[0][0]                
                                                                 object_gap4[0][0]                
                                                                 object_gap5[0][0]                
__________________________________________________________________________________________________
text_dropout_1 (Dropout)        (None, 128)          0           text_dense_1[0][0]               
__________________________________________________________________________________________________
object_dense_1 (Dense)          (None, 2)            130         object_average[0][0]             
__________________________________________________________________________________________________
text_dense_2 (Dense)            (None, 2)            258         text_dropout_1[0][0]             
__________________________________________________________________________________________________
average (Average)               (None, 2)            0           object_dense_1[0][0]             
                                                                 text_dense_2[0][0]               
==================================================================================================
Total params: 3,520,772
Trainable params: 3,498,884
Non-trainable params: 21,888
__________________________________________________________________________________________________
